# SphericalLightDistribution Constructor

---
C#Visual BasicVisual C++
Revit 2024 API
---
SphericalLightDistribution Constructor
SphericalLightDistribution Class See Also
---
Creates a spherical light distribution object.
**Namespace:** Autodesk.Revit.DB.Lighting**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public SphericalLightDistribution()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
SphericalLightDistribution()
```

# See Also
SphericalLightDistribution Class
SphericalLightDistribution Overload
Autodesk.Revit.DB.Lighting Namespace